LukaJala/TELEMETRY/RECEIVE-TEST-BACKUP-WORKING-1/ReceiveTest/sdkconfig.defaults
# Target
CONFIG_IDF_TARGET="esp32p4"

# PSRAM / SPIRAM (required for display frame buffer ~3MB)
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_HEX=y
CONFIG_SPIRAM_SPEED_200M=y
CONFIG_SPIRAM_BOOT_INIT=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_MEMTEST=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=16384
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=32768

# PSRAM power (LDO channel 2 at 1.8V for ESP32-P4)
CONFIG_ESP_LDO_CHAN_PSRAM_DOMAIN=2
CONFIG_ESP_LDO_VOLTAGE_PSRAM_1800_MV=y

# Ethernet
CONFIG_ETH_ENABLED=y
CONFIG_ETH_USE_ESP32_EMAC=y

# LVGL fonts
CONFIG_LV_FONT_MONTSERRAT_24=y
CONFIG_LV_FONT_MONTSERRAT_32=y
CONFIG_LV_FONT_MONTSERRAT_48=y

# Stack size
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# Camera sensor driver
CONFIG_CAMERA_OV5647=y

# DMA2D: keep ISR and operation funcs in IRAM to prevent stalls
# during DSI pixel transfers (eliminates flash cache miss latency)
CONFIG_DMA2D_OPERATION_FUNC_IN_IRAM=y
CONFIG_DMA2D_ISR_IRAM_SAFE=y
